philips-software/amp-hal-st/st/CMSIS_STM32WBAxx/ARM.CMSIS.pdsc
    <condition id="GCC ARMv8-MBL LE">
        <description>GNU Compiler for Armv8-M base line architecture (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv8-MBL Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="GCC ARMv8-MML NOFP LE">
        <description>GNU Compiler for Armv8-M/Armv8.1-M main line architecture without FPU/MVE (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv8x-MML Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
        <require Dmve="NO_MVE"/>
    </condition>
     <condition id="GCC ARMv8-MML FP LE">
        <description>GNU Compiler for Armv8-M/Armv8.1-M main line architecture with FPU/MVE (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv8x-MML Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
        <accept Dmve="MVE"/>
        <accept Dmve="FP_MVE"/>
    </condition>

    <condition id="IARCC ARMv6-M LE">
        <description>IAR Compiler for Armv6-M architecture (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="IARCC ARMv6-M BE">
        <description>IAR Compiler for Armv6-M architecture (big endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Big-endian"/>
    </condition>
    <condition id="IARCC ARMv7-M NOFP LE">
        <description>IAR Compiler for Armv7-M architecture without FPU (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="IARCC ARMv7-M NOFP BE">
        <description>IAR Compiler for Armv7-M architecture without FPU (big endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="IARCC ARMv7-M FP LE">
        <description>IAR Compiler for Armv7-M architecture with FPU (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="IARCC ARMv7-M FP BE">
        <description>IAR Compiler for Armv7-M architecture with FPU (big endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="IARCC ARMv8-MBL LE">
        <description>IAR Compiler for Armv8-M base line architecture (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv8-MBL Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="IARCC ARMv8-MML NOFP LE">
        <description>IAR Compiler for Armv8-M main line architecture without FPU (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv8-MML Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="IARCC ARMv8-MML FP LE">
        <description>IAR Compiler for Armv8-M main line architecture with FPU (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv8-MML Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="IARCC ARMv81-MML NOFP LE">
        <description>IAR Compiler for Armv8.1-M main line architecture without FPU/MVE (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv81-MML Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
        <require Dmve="NO_MVE"/>
    </condition>
     <condition id="IARCC ARMv81-MML FP LE">
        <description>IAR Compiler for Armv8.1-M main line architecture with FPU/MVE (little endian)</description>
        <require condition="IAR"/>
        <require condition="ARMv81-MML Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
        <accept Dmve="MVE"/>
        <accept Dmve="FP_MVE"/>
    </condition>

    <condition id="ARMASM ARMv6-M">
        <description>Arm Assembler for Armv6-M architecture</description>
        <require condition="ARMCC5"/>
        <require condition="ARMv6-M Device"/>
    </condition>
    <condition id="GNUASM ARMv6-M">
        <description>GNU Assembler for Armv6-M architecture</description>
        <accept condition="ARMCC6"/>
        <accept condition="GCC"/>
        <require condition="ARMv6-M Device"/>
    </condition>
    <condition id="IARASM ARMv6-M">
        <description>IAR Assembler for Armv6-M architecture</description>
        <require condition="IAR"/>
        <require condition="ARMv6-M Device"/>
    </condition>

    <condition id="ARMASM ARMv7-M">
        <description>Arm Assembler for Armv7-M architecture</description>
        <require condition="ARMCC5"/>
        <require condition="ARMv7-M Device"/>
    </condition>
    <condition id="GNUASM ARMv7-M">
        <description>GNU Assembler for Armv7-M architecture</description>
        <accept condition="ARMCC6"/>
        <accept condition="GCC"/>
        <require condition="ARMv7-M Device"/>
    </condition>
    <condition id="IARASM ARMv7-M">
        <description>IAR Assembler for Armv7-M architecture</description>
        <require condition="IAR"/>
        <require condition="ARMv7-M Device"/>
    </condition>

