philips-software/amp-hal-st/st/CMSIS_STM32WBAxx/ARM.CMSIS.pdsc
        <!-- RTX sources (core) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_kernel.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_thread.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_delay.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_timer.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_evflags.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_mutex.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_semaphore.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_memory.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_mempool.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_msgqueue.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_system.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_evr.c"/>
        <!-- RTX sources (library configuration) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_lib.c"/>
        <!-- RTX sources (handlers ARMASM) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/ARM/irq_armv7a.s" condition="ARMASM ARMv7-A"/>
        <!-- RTX sources (handlers GAS) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/GCC/irq_armv7a.S" condition="GNUASM ARMv7-A"/>
        <!-- RTX sources (handlers IAR) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/IAR/irq_armv7a.s" condition="IARASM ARMv7-A"/>
      </files>
    </component>
    <component Cclass="CMSIS" Cgroup="RTOS2" Csub="Keil RTX5" Cvariant="Source_NS" Cversion="5.5.4" Capiversion="2.1.3" condition="RTOS2 RTX5 NS">
      <description>CMSIS-RTOS2 RTX5 for Armv8-M/Armv8.1-M Non-Secure Domain (Source)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_CMSIS_RTOS2                 /* CMSIS-RTOS2 */
        #define RTE_CMSIS_RTOS2_RTX5            /* CMSIS-RTOS2 Keil RTX5 */
        #define RTE_CMSIS_RTOS2_RTX5_SOURCE     /* CMSIS-RTOS2 Keil RTX5 Source */
        #define RTE_CMSIS_RTOS2_RTX5_ARMV8M_NS  /* CMSIS-RTOS2 Keil RTX5 Armv8-M Non-secure domain */
      </RTE_Components_h>
      <files>
        <!-- RTX documentation -->
        <file category="doc"    name="CMSIS/Documentation/RTOS2/html/rtx5_impl.html"/>

        <!-- RTX header files -->
        <file category="header" name="CMSIS/RTOS2/RTX/Include/rtx_os.h"/>

        <!-- RTX configuration -->
        <file category="header" attr="config"   name="CMSIS/RTOS2/RTX/Config/RTX_Config.h"  version="5.5.2"/>
        <file category="source" attr="config"   name="CMSIS/RTOS2/RTX/Config/RTX_Config.c"  version="5.1.1"/>

        <!-- RTX templates -->
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/main.c"      version="2.1.0" select="CMSIS-RTOS2 'main' function"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/Events.c"    version="2.0.0" select="CMSIS-RTOS2 Events"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/MemPool.c"   version="2.0.0" select="CMSIS-RTOS2 Memory Pool"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/MsgQueue.c"  version="2.0.0" select="CMSIS-RTOS2 Message Queue"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/Mutex.c"     version="2.0.0" select="CMSIS-RTOS2 Mutex"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/Semaphore.c" version="2.0.0" select="CMSIS-RTOS2 Semaphore"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/Thread.c"    version="2.0.0" select="CMSIS-RTOS2 Thread"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/Timer.c"     version="2.0.1" select="CMSIS-RTOS2 Timer"/>
        <file category="source" attr="template" name="CMSIS/RTOS2/RTX/Template/svc_user.c"  version="1.0.0" select="CMSIS-RTOS2 SVC User Table"/>
        <file category="other"  name="CMSIS/RTOS2/RTX/RTX5.scvd"/>

        <!-- RTX sources (core) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_kernel.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_thread.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_delay.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_timer.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_evflags.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_mutex.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_semaphore.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_memory.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_mempool.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_msgqueue.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_system.c"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_evr.c"/>
        <!-- RTX sources (library configuration) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/rtx_lib.c"/>
        <!-- RTX sources (GAS handlers) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/GCC/irq_armv8mbl.S" condition="GNUASM ARMv8-MBL"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/GCC/irq_armv8mml.S" condition="GNUASM ARMv8-MML"/>
        <!-- RTX sources (IAR handlers) -->
        <file category="source" name="CMSIS/RTOS2/RTX/Source/IAR/irq_armv8mbl.s" condition="IARASM ARMv8-MBL"/>
        <file category="source" name="CMSIS/RTOS2/RTX/Source/IAR/irq_armv8mml.s" condition="IARASM ARMv8-MML"/>
        <!-- OS Tick (SysTick) -->
        <file category="source" name="CMSIS/RTOS2/Source/os_systick.c"/>
      </files>
    </component>

    <!-- CMSIS-Driver Custom components -->
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="Custom" Cversion="1.0.0" Capiversion="2.4.0" custom="1">
      <description>Access to #include Driver_USART.h file and code template for custom implementation</description>
      <files>
        <file category="header" name="CMSIS/Driver/Include/Driver_USART.h" />
        <file category="sourceC" attr="template" name="CMSIS/Driver/DriverTemplates/Driver_USART.c" select="USART Driver"/>
      </files>
    </component>
